import React, {useState, useEffect} from "react";
import start from "./Vectopguys.png";
import {NavLink} from "react-router-dom";
import {ICONS} from "../assets/pagesdb";
export default function HomePage () {
	const [currentIndex, setCurrentIndex] = useState(0);
	let toScroll = true;
	let list = [
		{
			title: "Анастасия",
			reason: "Ремонт ноутбука",
			description: "Ранее у меня был неприятный опыт с Владом Столяровым, он наебал меня на 200 рублей. Я думала, что больше не буду обращаться в компании по ремонту техники. Но тут у меня снова наебнулся жесткий диск и я рискнула и позвонила пацанам. Они мне все починили за 10 рублей. Заебись, ребята!",
			image: (
				<svg xmlns="http://www.w3.org/2000/svg" width="88" height="100" viewBox="0 0 88 100" fill="none">
					<path d="M33.2159 42.9829C33.2159 42.9829 12.1973 47.6092 5.52218 67.4632C4.16378 71.5094 5.55139 76.0197 8.57492 79.0653C18.9017 89.4781 46.3763 110.318 80.0149 80.9216C83.6373 77.76 84.9519 72.6696 83.2867 68.1738C80.4385 60.4585 75.9689 50.2052 58.0761 42.9829M65.6568 25.0867C65.6568 36.7323 56.148 46.1735 44.4191 46.1735C39.2922 46.1735 34.5889 44.3751 30.9227 41.3731C26.1903 37.5009 23.1813 31.6419 23.1813 25.0867C23.1813 13.4412 32.6901 4 44.4191 4C56.148 4 65.6568 13.4412 65.6568 25.0867Z" stroke="#FE6A25" stroke-width="8" stroke-miterlimit="10"/>
				</svg>
			),
			index: 0
		},
		{
			title: "Анастасия",
			reason: "Ремонт ноутбука",
			description: "Ранее у меня был неприятный опыт с Владом Столяровым, он наебал меня на 200 рублей. Я думала, что больше не буду обращаться в компании по ремонту техники. Но тут у меня снова наебнулся жесткий диск и я рискнула и позвонила пацанам. Они мне все починили за 10 рублей. Заебись, ребята!",
			image: (
				<svg xmlns="http://www.w3.org/2000/svg" width="88" height="100" viewBox="0 0 88 100" fill="none">
					<path d="M33.2159 42.9829C33.2159 42.9829 12.1973 47.6092 5.52218 67.4632C4.16378 71.5094 5.55139 76.0197 8.57492 79.0653C18.9017 89.4781 46.3763 110.318 80.0149 80.9216C83.6373 77.76 84.9519 72.6696 83.2867 68.1738C80.4385 60.4585 75.9689 50.2052 58.0761 42.9829M65.6568 25.0867C65.6568 36.7323 56.148 46.1735 44.4191 46.1735C39.2922 46.1735 34.5889 44.3751 30.9227 41.3731C26.1903 37.5009 23.1813 31.6419 23.1813 25.0867C23.1813 13.4412 32.6901 4 44.4191 4C56.148 4 65.6568 13.4412 65.6568 25.0867Z" stroke="#FE6A25" stroke-width="8" stroke-miterlimit="10"/>
				</svg>
			),
			index: 1
		},
		{
			title: "Анастасия",
			reason: "Ремонт ноутбука",
			description: "Ранее у меня был неприятный опыт с Владом Столяровым, он наебал меня на 200 рублей. Я думала, что больше не буду обращаться в компании по ремонту техники. Но тут у меня снова наебнулся жесткий диск и я рискнула и позвонила пацанам. Они мне все починили за 10 рублей. Заебись, ребята!",
			image: (
				<svg xmlns="http://www.w3.org/2000/svg" width="88" height="100" viewBox="0 0 88 100" fill="none">
					<path d="M33.2159 42.9829C33.2159 42.9829 12.1973 47.6092 5.52218 67.4632C4.16378 71.5094 5.55139 76.0197 8.57492 79.0653C18.9017 89.4781 46.3763 110.318 80.0149 80.9216C83.6373 77.76 84.9519 72.6696 83.2867 68.1738C80.4385 60.4585 75.9689 50.2052 58.0761 42.9829M65.6568 25.0867C65.6568 36.7323 56.148 46.1735 44.4191 46.1735C39.2922 46.1735 34.5889 44.3751 30.9227 41.3731C26.1903 37.5009 23.1813 31.6419 23.1813 25.0867C23.1813 13.4412 32.6901 4 44.4191 4C56.148 4 65.6568 13.4412 65.6568 25.0867Z" stroke="#FE6A25" stroke-width="8" stroke-miterlimit="10"/>
				</svg>
			),
			index: 2
		},
		{
			title: "Анастасия",
			reason: "Ремонт ноутбука",
			description: "Ранее у меня был неприятный опыт с Владом Столяровым, он наебал меня на 200 рублей. Я думала, что больше не буду обращаться в компании по ремонту техники. Но тут у меня снова наебнулся жесткий диск и я рискнула и позвонила пацанам. Они мне все починили за 10 рублей. Заебись, ребята!",
			image: (
				<svg xmlns="http://www.w3.org/2000/svg" width="88" height="100" viewBox="0 0 88 100" fill="none">
					<path d="M33.2159 42.9829C33.2159 42.9829 12.1973 47.6092 5.52218 67.4632C4.16378 71.5094 5.55139 76.0197 8.57492 79.0653C18.9017 89.4781 46.3763 110.318 80.0149 80.9216C83.6373 77.76 84.9519 72.6696 83.2867 68.1738C80.4385 60.4585 75.9689 50.2052 58.0761 42.9829M65.6568 25.0867C65.6568 36.7323 56.148 46.1735 44.4191 46.1735C39.2922 46.1735 34.5889 44.3751 30.9227 41.3731C26.1903 37.5009 23.1813 31.6419 23.1813 25.0867C23.1813 13.4412 32.6901 4 44.4191 4C56.148 4 65.6568 13.4412 65.6568 25.0867Z" stroke="#FE6A25" stroke-width="8" stroke-miterlimit="10"/>
				</svg>
			),
			index: 3
		},
		{
			title: "Анастасия",
			reason: "Ремонт ноутбука",
			description: "Ранее у меня был неприятный опыт с Владом Столяровым, он наебал меня на 200 рублей. Я думала, что больше не буду обращаться в компании по ремонту техники. Но тут у меня снова наебнулся жесткий диск и я рискнула и позвонила пацанам. Они мне все починили за 10 рублей. Заебись, ребята!",
			image: (
				<svg xmlns="http://www.w3.org/2000/svg" width="88" height="100" viewBox="0 0 88 100" fill="none">
					<path d="M33.2159 42.9829C33.2159 42.9829 12.1973 47.6092 5.52218 67.4632C4.16378 71.5094 5.55139 76.0197 8.57492 79.0653C18.9017 89.4781 46.3763 110.318 80.0149 80.9216C83.6373 77.76 84.9519 72.6696 83.2867 68.1738C80.4385 60.4585 75.9689 50.2052 58.0761 42.9829M65.6568 25.0867C65.6568 36.7323 56.148 46.1735 44.4191 46.1735C39.2922 46.1735 34.5889 44.3751 30.9227 41.3731C26.1903 37.5009 23.1813 31.6419 23.1813 25.0867C23.1813 13.4412 32.6901 4 44.4191 4C56.148 4 65.6568 13.4412 65.6568 25.0867Z" stroke="#FE6A25" stroke-width="8" stroke-miterlimit="10"/>
				</svg>
			),
			index: 4
		},
		{
			title: "Анастасия",
			reason: "Ремонт ноутбука",
			description: "Ранее у меня был неприятный опыт с Владом Столяровым, он наебал меня на 200 рублей. Я думала, что больше не буду обращаться в компании по ремонту техники. Но тут у меня снова наебнулся жесткий диск и я рискнула и позвонила пацанам. Они мне все починили за 10 рублей. Заебись, ребята!",
			image: (
				<svg xmlns="http://www.w3.org/2000/svg" width="88" height="100" viewBox="0 0 88 100" fill="none">
					<path d="M33.2159 42.9829C33.2159 42.9829 12.1973 47.6092 5.52218 67.4632C4.16378 71.5094 5.55139 76.0197 8.57492 79.0653C18.9017 89.4781 46.3763 110.318 80.0149 80.9216C83.6373 77.76 84.9519 72.6696 83.2867 68.1738C80.4385 60.4585 75.9689 50.2052 58.0761 42.9829M65.6568 25.0867C65.6568 36.7323 56.148 46.1735 44.4191 46.1735C39.2922 46.1735 34.5889 44.3751 30.9227 41.3731C26.1903 37.5009 23.1813 31.6419 23.1813 25.0867C23.1813 13.4412 32.6901 4 44.4191 4C56.148 4 65.6568 13.4412 65.6568 25.0867Z" stroke="#FE6A25" stroke-width="8" stroke-miterlimit="10"/>
				</svg>
			),
			index: 5
		},
		{
			title: "Анастасия",
			reason: "Ремонт ноутбука",
			description: "Ранее у меня был неприятный опыт с Владом Столяровым, он наебал меня на 200 рублей. Я думала, что больше не буду обращаться в компании по ремонту техники. Но тут у меня снова наебнулся жесткий диск и я рискнула и позвонила пацанам. Они мне все починили за 10 рублей. Заебись, ребята!",
			image: (
				<svg xmlns="http://www.w3.org/2000/svg" width="88" height="100" viewBox="0 0 88 100" fill="none">
					<path d="M33.2159 42.9829C33.2159 42.9829 12.1973 47.6092 5.52218 67.4632C4.16378 71.5094 5.55139 76.0197 8.57492 79.0653C18.9017 89.4781 46.3763 110.318 80.0149 80.9216C83.6373 77.76 84.9519 72.6696 83.2867 68.1738C80.4385 60.4585 75.9689 50.2052 58.0761 42.9829M65.6568 25.0867C65.6568 36.7323 56.148 46.1735 44.4191 46.1735C39.2922 46.1735 34.5889 44.3751 30.9227 41.3731C26.1903 37.5009 23.1813 31.6419 23.1813 25.0867C23.1813 13.4412 32.6901 4 44.4191 4C56.148 4 65.6568 13.4412 65.6568 25.0867Z" stroke="#FE6A25" stroke-width="8" stroke-miterlimit="10"/>
				</svg>
			),
			index: 6
		},
		{
			title: "Анастасия",
			reason: "Ремонт ноутбука",
			description: "Ранее у меня был неприятный опыт с Владом Столяровым, он наебал меня на 200 рублей. Я думала, что больше не буду обращаться в компании по ремонту техники. Но тут у меня снова наебнулся жесткий диск и я рискнула и позвонила пацанам. Они мне все починили за 10 рублей. Заебись, ребята!",
			image: (
				<svg xmlns="http://www.w3.org/2000/svg" width="88" height="100" viewBox="0 0 88 100" fill="none">
					<path d="M33.2159 42.9829C33.2159 42.9829 12.1973 47.6092 5.52218 67.4632C4.16378 71.5094 5.55139 76.0197 8.57492 79.0653C18.9017 89.4781 46.3763 110.318 80.0149 80.9216C83.6373 77.76 84.9519 72.6696 83.2867 68.1738C80.4385 60.4585 75.9689 50.2052 58.0761 42.9829M65.6568 25.0867C65.6568 36.7323 56.148 46.1735 44.4191 46.1735C39.2922 46.1735 34.5889 44.3751 30.9227 41.3731C26.1903 37.5009 23.1813 31.6419 23.1813 25.0867C23.1813 13.4412 32.6901 4 44.4191 4C56.148 4 65.6568 13.4412 65.6568 25.0867Z" stroke="#FE6A25" stroke-width="8" stroke-miterlimit="10"/>
				</svg>
			),
			index: 7
		}
	]

	let timer;

	let disableScroll = () => {
		toScroll = false;
		clearTimeout(timer);
		timer = setTimeout(() => {
			toScroll = true;
		}, 15000);
	}

	useEffect(() => {
		setInterval(() => {
			if (toScroll) {
				let index = currentIndex;
				if (index !== list.length-1) {
					setCurrentIndex(index+1)
				} else {
					setCurrentIndex(0)
				}
			}
		}, 5000)
	}, [])

	let dataList = [
		{
			icon: ICONS.magnifier,
			title: "Глубокая диагностика компьютера",
			price: "15 р"
		},
		{
			icon: ICONS.chip,
			title: "Ремонт/замена материнской платы",
			price: "от 20 р"
		},
		{
			icon: ICONS.hdd,
			title: "Ремонт/замена жесткого диска",
			price: "от 50 р"
		},
		{
			icon: ICONS.bp,
			title: "Ремонт/замена блока питания",
			price: "от 50 р"
		},
		{
			icon: ICONS.video,
			title: "Ремонт/замена видеокарты",
			price: "от 50 р"
		},
		{
			icon: ICONS.chip,
			title: "Ремонт/замена процессора",
			price: "от 40 р"
		},
		{
			icon: ICONS.chip,
			title: "Ремонт/замена оперативной памяти",
			price: "от 15 р"
		},
		{
			icon: ICONS.clean,
			title: "Чистка от пыли",
			price: "от 15 р"
		},
		{
			icon: ICONS.paste,
			title: "Замена термопасты",
			price: "от 10 р"
		},
		{
			icon: ICONS.cubes,
			title: "Модернизация компьютера",
			price: "от 30 р"
		},
		{
			icon: ICONS.cubes,
			title: "Сборка компьютера на заказ",
			price: "от 25 р"
		},
		{
			icon: ICONS.hdd,
			title: "Восстановление данных",
			price: "от 30 р"
		}
	]

    return(
        <div className="body">
            <div className="body-container">
                <div className="remont">
                    <h1>Ремонт компьютеров<br/>с выездом на дом</h1>
                    <p className="start-text">Производим ремонт пк любой сложности
                        тут какой-то текст похуй ваще на него я
                        не ебучий копирайтер длять не умею
                        писать всякую хуету. Короче хули тут думать
                        вызывай ебучего мастера и не еби нам
                        голову.</p>
                    <button className="button-master">Вызвать мастера</button>
                </div>
                <div className="image-start">
                    <img src={start} alt="Photo"/>
                </div>
            </div>
            <div className="body2">
                <h1 className="text-garant">Мы гарантируем:</h1>
                <div className="garantee">
                    <div className="we-offer-main-text">
	                    <svg xmlns="http://www.w3.org/2000/svg" width="47" height="47" viewBox="0 0 47 47" fill="none">
		                    <path d="M23.0022 0C10.2968 0 0 10.2968 0 23.0022C0 35.7032 10.2968 46.0044 23.0022 46.0044C35.7032
		                    46.0044 46.0044 35.7076 46.0044 23.0022C46 10.2968 35.7032 0 23.0022 0ZM23.0022 40.6432C13.2582 40.6432 5.36118 32.7462 5.36118 23.0022C5.36118 13.2582 13.2582 5.36118 23.0022 5.36118C32.7462 5.36118 40.6432 13.2582 40.6432 23.0022C40.6432 32.7462 32.7418 40.6432 23.0022 40.6432Z" fill="#FE6A25"/>
		                    <path d="M24.2262 12.2754C22.8399 12.2754 22.3222 13.5477 22.3222 13.5477V23.8971H15.851C15.851 23.8971 14.5436 24.156 14.5085 25.5116C14.4691 26.8673 15.0306 27.4289 15.9256 27.4639C16.8206 27.499 26.0425 27.4639 26.0425 27.4639V13.4775C26.0469 13.4775 25.6126 12.2754 24.2262 12.2754Z" fill="#FE6A25"/>
	                    </svg>
                        <div className="we-offer-text">
                            <p>Быстрый и качественный ремонт</p>
	                        <p className="we-offer-minor-text">Компьютерный сервис PC helper  уже более 4 лет радует клиентов качественным сервисом и быстрым обслуживаем.</p>
                        </div>
                    </div>
                    <div className="we-offer-main-text">
                        <svg xmlns="http://www.w3.org/2000/svg" width="47" height="46" viewBox="0 0 47 46" fill="none">
                            <path d="M45.998 19.7811C45.9046 15.5562 43.4297 15.3389 41.2888 14.915C39.1479 14.4911
                            29.9163 14.3985 29.9163 14.3985C32.1793 1.96959 23.835 0.031703 23.0375
                            -0.000357718C22.2401 -0.0324184 19.0036 1.18233 19.0036 3.39452C18.9102 13.1873 11.4926 15.7664 11.4926 15.7664C10.2318 14.7654 9.17574 14.3557 6.2949 14.427C2.52682 14.427 1.21213 15.1857 0.601476 16.5786C-0.131306 18.1567 -0.0091755 17.3374 0.0518896 29.7662C0.112955 42.1951 -0.0702406 42.2557 0.479346 43.4704C1.79404 46.1991 4.63537 45.9248 4.63537 45.9248C4.63537 45.9248 6.53198 45.9248 9.03924 45.9248C11.5465 45.9248 12.5846 43.4704 12.5846 43.4704C12.5846 43.4704 17.5668 44.6531 20.5015 45.2907C23.4362 45.9284 30.5916 46.1101 34.2591 45.9355C37.5136 45.679 39.2126 45.3371 41.5977 41.2903C44.8952 33.471 46.0986 24.4192 45.998 19.7811ZM10.1205 41.2475C10.1205 41.2475 10.142 43.0892 8.26695 43.1106C6.05423 43.1391 4.40188 43.1106 4.40188 43.1106C4.40188 43.1106 2.91117 42.9895 2.88962 41.5076C2.86448 39.8475 2.88962 18.8264 2.88962 18.8264C2.88962 18.8264 2.79623 17.2661 4.72517 17.2661H8.5148C8.5148 17.2661 10.1205 17.259 10.1205 19.0081C10.1205 20.9638 10.1205 41.2475 10.1205 41.2475ZM38.8175 41.3686C37.1939 44.019 26.3279 43.3992 21.3385 42.7864C17.301 42.3447 12.8001 40.5351 12.8001 40.5351L13.0767 17.829C23.4865 13.5542 20.2752 2.1869 23.2028 2.9136C30.2073 4.95837 26.1483 17.1486 26.1483 17.1486C37.201 17.5119 43.4836 16.1939 43.5734 19.8773C43.6596 23.5571 41.9713 35.1702 38.8175 41.3686Z" fill="#FE6A25"/>
                        </svg>
	                    <div className="we-offer-text">
		                    <p>Бесплатный выезд <br/>и диагностика</p>
		                    <p className="we-offer-minor-text">При продолжении работ после проведения диагностики вы платите только за ремонт.</p>
	                    </div>
                    </div>
                    <div className="we-offer-main-text">
                        <svg xmlns="http://www.w3.org/2000/svg" width="41" height="46" viewBox="0 0 41 46" fill="none">
                            <path d="M40.9623 8.05375C40.9623 8.05375 30.3246 1.73299 21.0286 0C12.378 1.46685 1.02698 8.05375 1.02698
                            8.05375C1.02698 8.05375 -0.625481 40.6463 20.9938 46C42.7741 41.0022 40.9623 8.05375 40.9623 8.05375ZM21.0286 43.1746V2.79908C21.0286 2.79908 28.4907 4.18238 38.2018 9.67379C38.7053 20.3394 34.3792 40.3492 21.0286 43.1746Z" fill="#FE6A25"/>
                        </svg>
	                    <div className="we-offer-text">
		                    <p>Выгодные цены на <br/>ремонт</p>
		                    <p className="we-offer-minor-text">Только у нас вы сможете качественно и дешево починить свою технику. В первую очередь, мы работаем на совесть, а не на посредников</p>
	                    </div>
                    </div>

                </div>
	            <h1 className="text-services">Услуги сервиса ремонта компьютерной<br/>
	            техники PC helper</h1>
	            <div className="services">
		            <NavLink to="/windows" className="block">
			            <svg xmlns="http://www.w3.org/2000/svg" width="92" height="92" viewBox="0 0 92 92">
				            <path d="M0 43.7223H37.1652V7.46684L0 12.6462V43.7223Z"/>
				            <path d="M41.7272 6.96645V43.7223L91.8375 43.4688V0L41.7272 6.96645Z"/>
				            <path d="M41.7272 85.0336L91.8375 92V48.4467H41.7272V85.0336Z"/>
				            <path d="M0 79.3083L37.1652 84.3707V48.4467L0 47.6344V79.3083Z"/>
			            </svg>
			            <p className="text-block">Установка Windows</p>
			            <p className="text-block-minor">Подробнее...</p>
		            </NavLink>
		            <NavLink to="/programmes" className="block">
			            <svg xmlns="http://www.w3.org/2000/svg" width="79" height="92" viewBox="0 0 79 92" >
				            <path d="M24.7434 39.4124C24.7434 39.4124 25.745 38.3297 26.8598 39.1068C27.8614 39.9275 29.6643 41.4205 29.6643 41.4205C29.6643 41.4205 30.5265 42.3111 29.6643 43.3414C28.802 44.3716 20.38 55.7134 20.38 55.7134L29.612 68.2251C29.612 68.2251 30.692 69.5086 29.6643 70.373C28.6365 71.2373 26.886 72.5994 26.886 72.5994C26.886 72.5994 25.4925 73.2717 24.8044 72.4335C24.1077 71.5953 12.6025 55.8269 12.6025 55.8269L24.7434 39.4124Z"/>
				            <path d="M54.1116 39.4124C54.1116 39.4124 53.11 38.3297 51.9952 39.1068C50.9936 39.9275 49.1908 41.4205 49.1908 41.4205C49.1908 41.4205 48.3285 42.3111 49.1908 43.3414C50.053 44.3716 58.475 55.7134 58.475 55.7134L49.243 68.2251C49.243 68.2251 48.163 69.5086 49.1908 70.373C50.2185 71.2373 51.9691 72.5994 51.9691 72.5994C51.9691 72.5994 53.3626 73.2717 54.0506 72.4335C54.7474 71.5953 66.2525 55.8269 66.2525 55.8269L54.1116 39.4124Z" />
				            <path d="M78.5676 28.6905C78.4892 21.9326 75.2319 19.776 75.2319 19.776C75.2319 19.776 62.6294 6.91506 59.224 3.57104C55.8186 0.22701 51.2201 0 51.2201 0H4.52019C0.661915 0 0 4.9069 0 4.9069C0 4.9069 0 82.8585 0 87.2415C0 91.6246 4.59857 92 4.59857 92C4.59857 92 69.0831 92 74.3523 92C79.0989 90.8126 78.5067 87.2415 78.5067 87.2415C78.5067 87.2415 78.6373 35.4484 78.5676 28.6905ZM52.6223 7.13334C52.6223 7.13334 53.2929 6.46104 56.9944 10.1019C60.1472 13.2102 66.6444 19.8459 68.517 21.758C68.7782 22.0287 69.0482 22.2906 69.3269 22.5525C70.0585 23.2336 71.8962 25.0496 71.8962 26.2371H52.6223V7.13334ZM72.4188 85.5302H6.48851V6.5047H45.9596V28.2365C45.9596 28.2365 46.9612 32.8029 50.6278 32.8029C54.2945 32.8029 72.4188 32.8029 72.4188 32.8029V85.5302Z"/>
				            <path d="M45.2889 33.3704C45.2889 33.3704 42.8416 32.8116 41.3958 32.7418C39.9501 32.6632 39.7672 34.1911 39.7672 34.1911C39.7672 34.1911 33.0609 74.7996 32.7996 76.6245C32.5384 78.4493 33.9493 78.5977 33.9493 78.5977C33.9493 78.5977 36.2137 78.8596 37.5114 78.9731C38.8091 79.0866 39.1053 77.5587 39.1053 77.5587C39.1053 77.5587 45.8463 36.9851 46.0728 35.4222C46.2905 33.8506 45.2889 33.3704 45.2889 33.3704Z"/>
			            </svg>
			            <p className="text-block">Установка программ</p>
			            <p className="text-block-minor">Подробнее...</p>
		            </NavLink>
		            <NavLink to="/antivirus" className="block">
			            <svg xmlns="http://www.w3.org/2000/svg" width="80" height="92" viewBox="0 0 80 92">
				            <path d="M79.9263 16.107C79.9263 16.107 58.6517 3.46587 40.0601 0C22.7594 2.93361 0.0581068 16.107 0.0581068 16.107C0.0581068 16.107 -3.24671 81.2902 39.9906 91.9972C83.5499 82.0019 79.9263 16.107 79.9263 16.107ZM40.0601 86.3466V5.598C40.0601 5.598 54.9838 8.36451 74.4056 19.347C75.4125 40.6776 66.7606 80.696 40.0601 86.3466Z"/>
			            </svg>
			            <p className="text-block">Антивирусная защита</p>
			            <p className="text-block-minor">Подробнее...</p>
		            </NavLink>
		            <NavLink to="/network" className="block">
			            <svg xmlns="http://www.w3.org/2000/svg" width="127" height="90" viewBox="0 0 127 90">
				            <path d="M54.7992 76.991C54.7992 76.991 58.876 74.6033 63.3444 74.6033C67.8128 74.6033 72.903 77.6052 72.903 77.6052C72.903 77.6052 74.4385 78.7185 73.5556 80.4767C72.6727 82.2425 65.2715 89.4902 63.8281 89.9815C62.5459 90.4038 55.3597 83.4786 53.2714 80.3077C51.9278 78.4574 54.7992 76.991 54.7992 76.991Z"/>
				            <path d="M35.8355 62.9256C35.8355 62.9256 34.4613 61.6972 35.8355 60.3767C37.2098 59.0561 46.0314 50.3267 63.1294 49.6971C80.2275 49.0676 91.36 60.6224 91.36 60.6224C91.36 60.6224 92.2429 61.9429 91.36 62.9256C90.4771 63.9084 82.1008 72.039 82.1008 72.039C82.1008 72.039 81.4635 72.776 79.8436 71.7933C78.2236 70.8105 73.4251 66.5495 64.4039 65.9122C55.3827 65.275 46.8606 71.9392 46.8606 71.9392C46.8606 71.9392 45.732 72.776 44.7569 71.9392C43.7819 71.1023 35.8355 62.9256 35.8355 62.9256Z"/>
				            <path d="M12.3114 36.507C12.3114 36.507 10.9908 37.9504 9.3478 36.507C7.7048 35.0636 2.70667 31.555 0.211452 27.2939C-0.671472 25.8275 1.28632 24.3073 4.67214 21.4128C8.05796 18.5184 15.6511 11.954 28.6877 6.8561C41.7243 1.75817 52.6418 0 62.4922 0C72.3426 0 85.7707 1.81191 97.1873 6.2726C108.604 10.7333 119.875 18.4723 126.201 24.9906C127.721 26.9023 125.71 28.5684 125.71 28.5684C125.71 28.5684 119.782 35.7239 117.479 36.5531C115.176 37.3899 115.03 36.9446 113.218 35.3784C111.406 33.8122 98.0779 24.0232 88.6191 20.576C64.4423 11.7698 43.2751 18.7794 43.2751 18.7794C43.2751 18.7794 29.4171 22.2958 12.3114 36.507Z"/>
				            <path d="M29.2482 54.2192C29.2482 54.2192 28.2347 54.987 27.1598 54.2192C25.6397 53.1367 17.8853 44.937 17.8853 44.937C17.8853 44.937 16.8258 44.1846 17.8853 42.7182C18.7836 41.4744 31.7203 30.2344 47.352 26.7104C62.9836 23.1864 73.5249 25.29 81.31 27.3016C89.1028 29.3131 101.203 34.5032 108.903 42.9332C109.978 44.7451 108.366 45.8737 108.366 45.8737C108.366 45.8737 104.443 50.772 100.527 53.7663C98.7151 55.0868 97.6863 54.6492 96.5577 53.8661C95.4291 53.083 81.095 40.7297 62.9375 41.1213C44.803 41.5051 29.2482 54.2192 29.2482 54.2192Z"/>
			            </svg>
			            <p className="text-block">Настройка сетей</p>
			            <p className="text-block-minor">Подробнее...</p>
		            </NavLink>
		            <NavLink to="/fixpc" className="block">
			            <svg xmlns="http://www.w3.org/2000/svg" width="123" height="96" viewBox="0 0 123 96">
				            <path d="M77.1994 15.7375H10.495C4.69944 15.7375 0 20.6409 0 26.688V72.1336C0 78.1806 4.69944 83.0841 10.495 83.0841H39.0395V88.1244H14.2033C12.7397 88.1244 11.5583 89.364 11.5583 90.8843V93.2264C11.5583 94.7536 12.7462 95.9863 14.2033 95.9863H73.4976C74.9613 95.9863 76.1427 94.7468 76.1427 93.2264V90.8843C76.1427 89.3571 74.9547 88.1244 73.4976 88.1244H48.2545V83.0841H77.1994C82.9949 83.0841 87.6944 78.1806 87.6944 72.1336V26.688C87.6944 20.6409 82.9949 15.7375 77.1994 15.7375ZM79.9823 68.1615C79.9823 71.7158 77.2191 74.5921 73.8192 74.5921H13.4682C10.0618 74.5921 7.30513 71.709 7.30513 68.1615V30.3861C7.30513 26.8318 10.0683 23.9555 13.4682 23.9555H73.8127C77.2191 23.9555 79.9757 26.8386 79.9757 30.3861V68.1615H79.9823Z"/>
				            <path d="M60.095 16.9633V13.9021C60.095 13.9021 60.095 0 73.6683 0C87.2415 0 109.282 0 109.282 0C109.282 0 120.341 0.0890297 121.936 12.5051C121.936 24.9211 122.021 83.4949 122.021 83.4949C122.021 83.4949 121.516 94.0756 109.787 96C98.0581 96 73.4976 96 73.4976 96L61.2699 88.1313C61.2699 88.1313 60.1804 86.0905 60.095 83.0909C60.0097 80.0913 67.387 79.564 67.387 79.564L68.0565 83.0909C68.0565 83.0909 68.3059 87.693 73.1694 87.6108C78.4465 87.6108 108.862 87.7889 108.862 87.7889C108.862 87.7889 114.053 87.5286 114.139 82.9813C114.224 78.434 114.139 13.2173 114.139 13.2173C114.139 13.2173 113.804 8.49879 109.282 8.14952C104.589 8.14952 72.9988 8.14952 72.9988 8.14952C72.9988 8.14952 68.0565 8.32758 67.8859 13.7446C67.7152 19.1617 67.7152 21.7024 67.7152 21.7024L60.095 16.9633Z"/>
			            </svg>
			            <p className="text-block">Ремонт компьютеров</p>
			            <p className="text-block-minor">Подробнее...</p>
		            </NavLink>
		            <NavLink to="/fixlaptop" className="block">
			            <svg xmlns="http://www.w3.org/2000/svg" width="127" height="90" viewBox="0 0 127 90">
				            <path d="M99.267 0H28.1766C21.9991 0 16.9881 5.37451 16.9881 12.0001V61.7892C16.9881 68.4148 21.9991 73.7894 28.1766 73.7894H99.267C105.445 73.7894 110.456 68.4148 110.456 61.7892V12.0001C110.456 5.37451 105.445 0 99.267 0ZM102.241 57.4367C102.241 61.3311 99.2999 64.4853 95.669 64.4853H31.3475C27.7166 64.4853 24.7757 61.3311 24.7757 57.4367V16.0442C24.7757 12.1499 27.7166 8.99569 31.3475 8.99569H95.669C99.2999 8.99569 102.241 12.1499 102.241 16.0442V57.4367Z"/>
				            <path d="M0 78.3621C0 78.3621 0 81.0317 0 84.8027C0 89.3578 8.28868 89.9569 8.28868 89.9569C8.28868 89.9569 112.427 90.0538 118.818 89.9569C125.217 89.86 127 84.8027 127 84.8027V78.3621H0ZM69.5214 83.7542H57.9222C57.3389 83.7542 56.8707 83.252 56.8707 82.6264C56.8707 82.0009 57.3389 81.4987 57.9222 81.4987H69.5296C70.1129 81.4987 70.5811 82.0009 70.5811 82.6264C70.5729 83.252 70.1047 83.7542 69.5214 83.7542Z"/>
			            </svg>
			            <p className="text-block">Ремонт ноутбуков</p>
			            <p className="text-block-minor">Подробнее...</p>
		            </NavLink>
	            </div>
            </div>
	        <div className="body3">
		        <h1 className="text-prices">Компьютерная помощь по низким ценам</h1>
		        <div className="prices">
			        {
			            dataList.map((item, index) => (
					        <div key={index} className="block-help">
						        {item.icon}
						        <p className="text-prices-major">{item.title}</p>
						        <p className="text-prices-minor">{item.price}</p>
					        </div>
				        ))
			        }
		        </div>
	        </div>
	        <div className="body2">
		        <h1 className="text-garant">Клиенты любят PC | helper</h1>
		        <p className="text-describe">Отзывы клиентов обратившихся в нашу компанию</p>
		        <div className={`slider active-item-${currentIndex}`}>
			        <div className="wrapper" style={{transform: `translateX(-${currentIndex*(100/list.length)}%)`}}>
				        {
					        list.map(item => (
						        <div>
							        <pre>{JSON.stringify(item, null, 4)}</pre>
						        </div>
					        ))
				        }
			        </div>
		        </div>
		        <div className="status">
			        {
				        list.map(item => (
					        <div>
						        {
							        item.index === currentIndex ?
								        <div className="point active-point"/>
								        :
								        <div className="point" onClick={() => {disableScroll(); setCurrentIndex(item.index)}}/>
						        }
					        </div>
				        ))
			        }
		        </div>
	        </div>
        </div>
    )
}
